eldar6776/DE-020717/fw/STM32F746_Discovery/Src/main.c
/**
 ******************************************************************************
 * File Name          : main.c
 * Date               : 10.3.2018.
 * Description        : Hotel Room Thermostat Program Code
 ******************************************************************************
 *
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "WM.h"
#include "GUI.h"
#include <math.h>
#include "main.h"
#include "common.h"
#include "display.h"
#include "one_wire.h"
#include "thermostat.h"
#include "waveplayer.h"
#include "stm32746g.h"
#include "stm32746g_ts.h"
#include "stm32746g_qspi.h"
#include "stm32746g_sdram.h"
#include "stm32746g_audio.h"


/* Imported Type  ------------------------------------------------------------*/
/* Imported Variable  --------------------------------------------------------*/
/* Imported Function  --------------------------------------------------------*/
/* Private Type --------------------------------------------------------------*/
ADC_HandleTypeDef hadc3;
UART_HandleTypeDef huart6;
TIM_HandleTypeDef htim3;
LTDC_HandleTypeDef  hltdc;
DMA2D_HandleTypeDef hdma2d;
CRC_HandleTypeDef hcrc;
RTC_HandleTypeDef hrtc;
RTC_TimeTypeDef time;
RTC_DateTypeDef date;


/* Private Define ------------------------------------------------------------*/
#define LED_STATUS_SYS_RUN_TIME				1234	// 1s led status toggle period
#define LED_STATUS_SYS_ERROR_TIME			123		// 100ms led status toggle period
#define TOUCH_SCREEN_UPDATE_TIME			5		// 5ms touch screen update period
#define NTC_RREF 							10000  	// 10k NTC value of at 25 degrees
#define NTC_B_VALUE 						3977 	// NTC resistance at 100 degrees
#define NTC_PULLUP							10000	// 10k pullup resistor

static enum
{
	ZERO_CROSS_TRIGGER_PENDING = 0,
	TRIAC_ON_IN_FIRST_HALF_PERIOD,
	TRIAC_OFF_IN_FIRST_HALF_PERIOD,
	TRIAC_ON_IN_SECOND_HALF_PERIOD,
	TRIAC_OFF_IN_SECOND_HALF_PERIOD
	
}TRIAC_ControlState;

/* Private Variable ----------------------------------------------------------*/
__IO uint32_t SystickCnt;

float ntc_calc;

uint32_t triac_timer;
uint32_t triac_on_timer;
uint32_t triac_on_time;

uint16_t ntc_temperature;
uint16_t ts_update_timer;
uint16_t rtc_bckp_tmr;
uint16_t anin_timer;
uint16_t led_timer;

uint8_t GUI_Initialized;
uint8_t uart_baudrate;
uint8_t SelLayer = 0;
uint8_t ntc_sample_cnt;
uint8_t zero_cross_cnt;

uint16_t ntc_sample_value[10] = {
	2100, 2100, 2100, 2100, 2100, 
	2100, 2100, 2100, 2100, 2100
};

uint8_t RTC_Months[2][12] = {
	{31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},	/* Not leap year */
	{31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}	/* Leap year */
};


/* Private Macro -------------------------------------------------------------*/
#define RTC_LEAP_YEAR(year)             ((((year) % 4 == 0) && ((year) % 100 != 0)) || ((year) % 400 == 0))
#define RTC_DAYS_IN_YEAR(x)             RTC_LEAP_YEAR(x) ? 366 : 365
#define RTC_BCD2BIN(x)                  ((((x) >> 4) & 0x0F) * 10 + ((x) & 0x0F))
#define RTC_CHAR2NUM(x)                 ((x) - '0')
#define RTC_CHARISNUM(x)                ((x) >= '0' && (x) <= '9')
#define FAN_CONTROL_LOOP_PERIOD			200	// fan speed control loop 


/* Private Function Prototype ------------------------------------------------*/
static void MPU_Config(void);
static void CACHE_Config(void);
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM_Init(void);
static void MX_UART6_Init(void);
static void MX_ADC3_Init(void);
void TouchUpdate(void);
void BootloaderExe(void);
void Error_Handler(void);
float NTC_GetResistance(uint16_t adc_value);
float NTC_GetTemperature(float ntc_resistance);

/* Program Code  -------------------------------------------------------------*/
int main(void)
{
	MPU_Config();
	CACHE_Config();
	HAL_Init(); 
	SystemClock_Config();
	MX_RTC_Init();
	MX_ADC3_Init();
	MX_UART6_Init();
	MX_TIM_Init();
	MX_GPIO_Init();
	LED_Init(LED1);
	BSP_QSPI_Init();
	BSP_QSPI_EnableMemoryMappedMode();
	SDRAM_Init();
	MX_CRC_Init();
	AUDIO_PLAYER_Init();
	TOUCH_SCREEN_Init(480, 272);
	BSP_TS_ITConfig();
	ONEWIRE_Init();
	THERMOSTAT_Init();
	DISPLAY_Init();
	
	while(1)
	{
		ONEWIRE_Service();
		THERMOSTAT_Service();
		DISPLAY_Service();
	}
}


static void MPU_Config(void)
{
	MPU_Region_InitTypeDef MPU_InitStruct;

	/* Disable the MPU */
	HAL_MPU_Disable();

	/* Configure the MPU attributes as WT for SRAM */
	MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
	MPU_InitStruct.BaseAddress      = 0x20010000;
	MPU_InitStruct.Size             = MPU_REGION_SIZE_256KB;
	MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
	MPU_InitStruct.IsCacheable      = MPU_ACCESS_CACHEABLE;
	MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
	MPU_InitStruct.Number           = MPU_REGION_NUMBER0;
	MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL0;
	MPU_InitStruct.SubRegionDisable = 0x00;
	MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;
	HAL_MPU_ConfigRegion(&MPU_InitStruct);

	/* Configure the MPU attributes for Quad-SPI area to strongly ordered
	 This setting is essentially needed to avoid MCU blockings! 
	 See also STM Application Note AN4861 */
	MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
	MPU_InitStruct.Number           = MPU_REGION_NUMBER2;
	MPU_InitStruct.BaseAddress      = 0x90000000;
	MPU_InitStruct.Size             = MPU_REGION_SIZE_256MB;
	MPU_InitStruct.SubRegionDisable = 0x0;
	MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL0;
	MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
	MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
	MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
	MPU_InitStruct.IsCacheable      = MPU_ACCESS_NOT_CACHEABLE;
	MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
	HAL_MPU_ConfigRegion(&MPU_InitStruct);

	/* Configure the MPU attributes for the QSPI 64MB to normal memory Cacheable, must reflect the real memory size */
	MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
	MPU_InitStruct.Number           = MPU_REGION_NUMBER3;
	MPU_InitStruct.BaseAddress      = 0x90000000;
	MPU_InitStruct.Size             = MPU_REGION_SIZE_16MB; // Set region size according to the QSPI memory size
	MPU_InitStruct.SubRegionDisable = 0x0;
	MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL0;
	MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
	MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
	MPU_InitStruct.IsCacheable      = MPU_ACCESS_CACHEABLE;
	MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
	HAL_MPU_ConfigRegion(&MPU_InitStruct);

	/* Configure the MPU attributes for SDRAM_Banks area to strongly ordered
	 This setting is essentially needed to avoid MCU blockings!
	 See also STM Application Note AN4861 */
	MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
	MPU_InitStruct.Number           = MPU_REGION_NUMBER4;
	MPU_InitStruct.BaseAddress      = 0xC0000000;
	MPU_InitStruct.Size             = MPU_REGION_SIZE_512MB;
	MPU_InitStruct.SubRegionDisable = 0x0;
	MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL0;
	MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
	MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
	MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
	MPU_InitStruct.IsCacheable      = MPU_ACCESS_NOT_CACHEABLE;
	MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
	HAL_MPU_ConfigRegion(&MPU_InitStruct);

	/* Configure the MPU attributes for SDRAM 16MB to normal memory Cacheable */
	MPU_InitStruct.Enable           = MPU_REGION_ENABLE;
	MPU_InitStruct.Number           = MPU_REGION_NUMBER5;
	MPU_InitStruct.BaseAddress      = 0xC0000000;
	MPU_InitStruct.Size             = MPU_REGION_SIZE_8MB;
	MPU_InitStruct.SubRegionDisable = 0x0;
	MPU_InitStruct.TypeExtField     = MPU_TEX_LEVEL0;
	MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
	MPU_InitStruct.DisableExec      = MPU_INSTRUCTION_ACCESS_ENABLE;
	MPU_InitStruct.IsShareable      = MPU_ACCESS_SHAREABLE;
	MPU_InitStruct.IsCacheable      = MPU_ACCESS_CACHEABLE;
	MPU_InitStruct.IsBufferable     = MPU_ACCESS_NOT_BUFFERABLE;
	HAL_MPU_ConfigRegion(&MPU_InitStruct);

	/* Enable the MPU */
	HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
	
	/* Disable FMC bank1 (0x6000 0000 - 0x6FFF FFFF), since it is not used.
	This setting avoids unnedded speculative access to the first FMC bank.
	See also STM Application Note AN4861 */
	FMC_Bank1->BTCR[0] = 0x000030D2;
}

