eldar6776/DE-020717/fw/STM32F746_Discovery/Src/main.c
static void CACHE_Config(void)
{
//	SCB_InvalidateICache();
//	SCB->CCR |= (1 <<18);
//	__DSB();
//	SCB_InvalidateICache();
	SCB_EnableICache();
//	SCB_InvalidateDCache();
	SCB_EnableDCache();	
	
//	__HAL_RCC_BKPSRAM_CLK_ENABLE();
}


void HAL_SYSTICK_Callback(void)
{
	uint8_t t;
	
	if(++rtc_bckp_tmr > 999U)
	{
		rtc_bckp_tmr = 0;
		HAL_RTC_GetDate(&hrtc, &date, RTC_FORMAT_BCD);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2, date.Date);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3, date.Month);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, date.WeekDay);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR5, date.Year);
	}
	
	if(hadc3.Instance == ADC3)
	{
		if (++anin_timer >= 123)
		{
			anin_timer = 0;			
			HAL_ADC_Start(&hadc3);
			HAL_ADC_PollForConversion(&hadc3, 10);
			ntc_sample_value[ntc_sample_cnt] = HAL_ADC_GetValue(&hadc3);
			if(++ntc_sample_cnt >  9) ntc_sample_cnt = 0;
			ntc_temperature = 0;
			for(t = 0; t < 10; t++) ntc_temperature += ntc_sample_value[t];
			ntc_temperature = ntc_temperature / 10;
			ntc_calc = NTC_GetResistance(ntc_temperature);
			ntc_calc = NTC_GetTemperature(ntc_calc);
			if(ntc_calc < 0) 
			{
				ntc_calc *= -1;
				ntc_temperature = (uint16_t) ntc_calc * 10;
				ntc_temperature |= 0x8000;
			}
			else ntc_temperature = (uint16_t) ntc_calc * 10;
		}
	}
	
	
	if(led_timer) --led_timer;
	else
	{
		led_timer = LED_STATUS_SYS_RUN_TIME;
		BSP_LED_Toggle(LED1);
	}
	
	if((ts_update_timer) && (GUI_Initialized == 1))
	{
		if(--ts_update_timer == 0)
		{
			__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_13);
			HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
		}
	}	
	
	if(onewire_timer) --onewire_timer;
	if(thermostat_timer) --thermostat_timer;
	if(thermostat_fan_timer) --thermostat_fan_timer;
	if(thermostat_valve_timer) --thermostat_valve_timer;
	if(display_timer) --display_timer;
	if(display_date_time_timer) --display_date_time_timer;
	if(display_doorbell_animation_timer) --display_doorbell_animation_timer;
}

static void SystemClock_Config(void)
{
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	HAL_StatusTypeDef ret = HAL_OK;

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 25;
	RCC_OscInitStruct.PLL.PLLN = 400;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	ret = HAL_PWREx_EnableOverDrive();

	if(ret != HAL_OK)
	{
		Error_Handler();
	}  

	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
	HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6);

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART6;
	PeriphClkInitStruct.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
	
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	
	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
	PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
	PeriphClkInitStruct.PLLSAI.PLLSAIR = 5;
	PeriphClkInitStruct.PLLSAIDivR = RCC_PLLSAIDIVR_4;
	
	if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
	{
		Error_Handler();
	}
	
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}



void RTC_GetDateTime(RTC_t* data, uint32_t format) 
{
	uint32_t unix;

	/* Get time */
	if (format == RTC_FORMAT_BIN) 
	{
		HAL_RTC_GetTime(&hrtc, &time, RTC_FORMAT_BIN);
	} 
	else 
	{
		HAL_RTC_GetTime(&hrtc, &time, RTC_FORMAT_BCD);
	}
	
	/* Format hours */
	data->hours = time.Hours;
	data->minutes = time.Minutes;
	data->seconds = time.Seconds;
	
	/* Get subseconds */
	data->subseconds = RTC->SSR;
	
	/* Get date */
	if (format == RTC_FORMAT_BIN) 
	{
		HAL_RTC_GetDate(&hrtc, &date, RTC_FORMAT_BIN);
	} 
	else 
	{
		HAL_RTC_GetDate(&hrtc, &date, RTC_FORMAT_BCD);
	}
	
	/* Format date */
	data->year = date.Year;
	data->month = date.Month;
	data->date = date.Date;
	data->day = date.WeekDay;
	
	/* Calculate unix offset */
	unix = RTC_GetUnixTimeStamp(data);
	data->unix = unix;
}


uint32_t RTC_GetUnixTimeStamp(RTC_t* data) 
{
	uint32_t days = 0, seconds = 0;
	uint16_t i;
	uint16_t year = (uint16_t) (data->year + 2000);
	
	/* Year is below offset year */
	if (year < RTC_OFFSET_YEAR) 
	{
		return 0;
	}
	
	/* Days in back years */
	for (i = RTC_OFFSET_YEAR; i < year; i++) 
	{
		days += RTC_DAYS_IN_YEAR(i);
	}
	
	/* Days in current year */
	for (i = 1; i < data->month; i++) 
	{
		days += RTC_Months[RTC_LEAP_YEAR(year)][i - 1];
	}
	
	/* Day starts with 1 */
	days += data->date - 1;
	seconds = days * RTC_SECONDS_PER_DAY;
	seconds += data->hours * RTC_SECONDS_PER_HOUR;
	seconds += data->minutes * RTC_SECONDS_PER_MINUTE;
	seconds += data->seconds;
	
	/* seconds = days * 86400; */
	return seconds;
}


void RTC_GetDateTimeFromUnix(RTC_t* data, uint32_t unix) 
{
	uint16_t year;
	
	/* Store unix time to unix in struct */
	data->unix = unix;
	/* Get seconds from unix */
	data->seconds = unix % 60;
	/* Go to minutes */
	unix /= 60;
	/* Get minutes */
	data->minutes = unix % 60;
	/* Go to hours */
	unix /= 60;
	/* Get hours */
	data->hours = unix % 24;
	/* Go to days */
	unix /= 24;
	
	/* Get week day */
	/* Monday is day one */
	data->day = (unix + 3) % 7 + 1;

	/* Get year */
	year = 1970;
	while (1) 
	{
		if (RTC_LEAP_YEAR(year)) 
		{
			if (unix >= 366) 
			{
				unix -= 366;
			} 
			else 
			{
				break;
			}
		} 
		else if (unix >= 365) 
		{
			unix -= 365;
		} 
		else 
		{
			break;
		}
		year++;
	}
	
	/* Get year in xx format */
	data->year = (uint8_t) (year - 2000);
	
	/* Get month */
	for (data->month = 0; data->month < 12; data->month++) 
	{
		if (RTC_LEAP_YEAR(year)) 
		{
			if (unix >= (uint32_t)RTC_Months[1][data->month]) 
			{
				unix -= RTC_Months[1][data->month];
			}
			else 
			{
				break;
			}
		} 
		else if (unix >= (uint32_t)RTC_Months[0][data->month]) 
		{
			unix -= RTC_Months[0][data->month];
		} 
		else
		{
			break;
		}
	}
	
