eldar6776/DE-020717/fw/STM32F746_Discovery/Src/main.c
	/* Get month */
	/* Month starts with 1 */
	data->month++;
	/* Get date */
	/* Date starts with 1 */
	data->date = unix + 1;
}


void HAL_RTC_MspInit(RTC_HandleTypeDef *hrtc)
{
	RCC_OscInitTypeDef        RCC_OscInitStruct;
	RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;

	RCC_OscInitStruct.OscillatorType =  RCC_OSCILLATORTYPE_LSI | RCC_OSCILLATORTYPE_LSE;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	RCC_OscInitStruct.LSEState = RCC_LSE_ON;
	RCC_OscInitStruct.LSIState = RCC_LSI_OFF;
	
	if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{ 
		return;
	}

	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
	PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
	
	if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
	{ 
		return;
	}

	__HAL_RCC_RTC_ENABLE(); 
}


void HAL_RTC_MspDeInit(RTC_HandleTypeDef *hrtc)
{
	__HAL_RCC_RTC_DISABLE();
}


static void MX_RTC_Init(void)
{
	hrtc.Instance = RTC; 
	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
	hrtc.Init.AsynchPrediv = RTC_ASYNCH_PREDIV;
	hrtc.Init.SynchPrediv = RTC_SYNCH_PREDIV;
	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;

	if (HAL_RTC_Init(&hrtc) != HAL_OK)
	{
		Error_Handler();
	}
	
	if (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1) != 0xA5A5)
	{
		time.Hours = 0x19;
		time.Minutes = 0x08;
		time.Seconds = 0;
		date.Date = 0x16;
		date.Month = 0x02;
		date.WeekDay = 0x05;
		date.Year = 0x18;
		HAL_RTC_SetTime(&hrtc, &time, RTC_FORMAT_BCD);
		HAL_RTC_SetDate(&hrtc, &date, RTC_FORMAT_BCD);
		HAL_RTC_WaitForSynchro(&hrtc);
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, 0xA5A5);
	}
	else 
	{
		date.Date = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR2);
		date.Month = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR3);
		date.WeekDay = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4);
		date.Year = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR5);
		HAL_RTC_SetDate(&hrtc, &date, RTC_FORMAT_BCD);
		HAL_RTC_WaitForSynchro(&hrtc);
	}
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	__HAL_TIM_CLEAR_FLAG(&htim3, TIM_FLAG_UPDATE);
	
	if(triac_on_time == 0) 
	{
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_RESET);
		return;
	}
	else if(++triac_timer < triac_on_timer) return;
	
	triac_timer = 0;
	triac_on_timer = 1;
	HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_RESET);
		
	if(TRIAC_ControlState == TRIAC_ON_IN_FIRST_HALF_PERIOD)
	{
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_SET);
		TRIAC_ControlState = TRIAC_OFF_IN_FIRST_HALF_PERIOD;
	}
	else if(TRIAC_ControlState == TRIAC_OFF_IN_FIRST_HALF_PERIOD)
	{
		triac_on_timer = 99;
		TRIAC_ControlState = TRIAC_ON_IN_SECOND_HALF_PERIOD;
	}
	else if(TRIAC_ControlState == TRIAC_ON_IN_SECOND_HALF_PERIOD)
	{
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_SET);
		TRIAC_ControlState = TRIAC_OFF_IN_SECOND_HALF_PERIOD;
	}
	else if(TRIAC_ControlState == TRIAC_OFF_IN_SECOND_HALF_PERIOD)
	{
		TRIAC_ControlState = ZERO_CROSS_TRIGGER_PENDING;
		HAL_TIM_Base_Stop_IT(&htim3);
		HAL_NVIC_DisableIRQ(TIM3_IRQn);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
		HAL_NVIC_EnableIRQ(EXTI3_IRQn);
	}
}


void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim)
{
	__HAL_RCC_TIM3_CLK_ENABLE();
	HAL_NVIC_SetPriority(TIM3_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
}


static void MX_TIM_Init(void)
{
	/**
	*	SYSCLK=200MHz => AHB prescaler/1 => HCLK=200MHz =>APB1 prescaler/4 => x2 => APB1 timer clock=100MHz
	*/
	htim3.Instance = TIM3;
	htim3.Init.Period = 9999;		// 100us 
	htim3.Init.Prescaler = 0;			
	htim3.Init.ClockDivision = 0;
	htim3.Init.CounterMode = TIM_COUNTERMODE_UP;

	if(HAL_TIM_Base_Init(&htim3) != HAL_OK)
	{
		Error_Handler();
	}
}


void HAL_UART_TxCpltCallback(UART_HandleTypeDef* huart)
{
	if(huart->Instance == USART6)
	{

	}
}


void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart)
{
	if(huart->Instance == USART6)
	{
		if	((onewire_buffer[0] == ONEWIRE_THERMOSTAT_ADDRESS) &&
			(onewire_buffer[1] == ONEWIRE_CONTROLLER_ADDRESS) &&
			(onewire_buffer[63] == CalcCRC(onewire_buffer, 63)))
		{
			onewire_buffer[64] = CalcCRC(onewire_buffer, 63);
			OnewireState = ONEWIRE_PACKET_RECEIVED;
		}
		else 
		{
			HAL_Delay(50);
			__HAL_UART_FLUSH_DRREGISTER(&huart6);
			HAL_UART_Receive_IT(&huart6, onewire_buffer, ONEWIRE_PACKET_SIZE);
			OnewireState = ONEWIRE_PACKET_PENDING;
		}			
	}
}


void HAL_UART_ErrorCallback(UART_HandleTypeDef* huart)
{
	if(huart->Instance == USART6)
	{
		__HAL_UART_CLEAR_PEFLAG(&huart6);
		__HAL_UART_CLEAR_FEFLAG(&huart6);
		__HAL_UART_CLEAR_NEFLAG(&huart6);
		__HAL_UART_CLEAR_IDLEFLAG(&huart6);
		__HAL_UART_CLEAR_OREFLAG(&huart6);
		HAL_Delay(50);
		__HAL_UART_FLUSH_DRREGISTER(&huart6);
		HAL_UART_Receive_IT(&huart6, onewire_buffer, ONEWIRE_PACKET_SIZE);
		OnewireState = ONEWIRE_PACKET_PENDING;
	}
}


static void MX_UART6_Init(void)
{
	GPIO_InitTypeDef  GPIO_InitStruct;
	
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_USART6_CLK_ENABLE();

	GPIO_InitStruct.Pin 		= GPIO_PIN_7;
	GPIO_InitStruct.Mode      	= GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull      	= GPIO_NOPULL;
	GPIO_InitStruct.Speed     	= GPIO_SPEED_HIGH;	
	GPIO_InitStruct.Alternate 	= GPIO_AF8_USART6;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);	
	
	GPIO_InitStruct.Pin       	= GPIO_PIN_6;
	GPIO_InitStruct.Mode      	= GPIO_MODE_AF_OD;
	GPIO_InitStruct.Pull      	= GPIO_PULLUP;
	GPIO_InitStruct.Speed     	= GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate 	= GPIO_AF8_USART6;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	HAL_NVIC_SetPriority(USART6_IRQn, 3,0);
	HAL_NVIC_EnableIRQ(USART6_IRQn);

	huart6.Instance			= USART6;
	huart6.Init.BaudRate 	= 9600;
	huart6.Init.WordLength	= UART_WORDLENGTH_8B;
	huart6.Init.StopBits	= UART_STOPBITS_1;
	huart6.Init.Parity		= UART_PARITY_NONE;
	huart6.Init.HwFlowCtl	= UART_HWCONTROL_NONE;
	huart6.Init.Mode		= UART_MODE_TX_RX;
	huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT; 
	
	if(HAL_UART_DeInit(&huart6) != HAL_OK) Error_Handler();
	if(HAL_HalfDuplex_Init(&huart6) != HAL_OK) Error_Handler();
}


void HAL_CRC_MspInit(CRC_HandleTypeDef* hcrc)
{
	if(hcrc->Instance == CRC)
	{
		__HAL_RCC_CRC_CLK_ENABLE();
	}
}


void HAL_CRC_MspDeInit(CRC_HandleTypeDef* hcrc)
{
	if(hcrc->Instance == CRC)
	{
		__HAL_RCC_CRC_CLK_DISABLE();
	}
}

static void MX_CRC_Init(void)
{
	hcrc.Instance = CRC;
	
	if (HAL_CRC_Init(&hcrc) != HAL_OK)
	{
		Error_Handler();
	}
}


static void MX_ADC3_Init(void)
{
	ADC_ChannelConfTypeDef sConfig;
	GPIO_InitTypeDef GPIO_InitStruct;

