eldar6776/DE-020717/fw/STM32F746_Discovery/Src/main.c
	__HAL_RCC_ADC3_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	
	GPIO_InitStruct.Pin = GPIO_PIN_0;
	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	
	hadc3.Instance = ADC3;
	hadc3.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
	hadc3.Init.Resolution = ADC_RESOLUTION_12B;
	hadc3.Init.ScanConvMode = DISABLE;
	hadc3.Init.ContinuousConvMode = DISABLE;
	hadc3.Init.DiscontinuousConvMode = DISABLE;
	hadc3.Init.NbrOfDiscConversion = 0;
	hadc3.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
	hadc3.Init.DataAlign = ADC_DATAALIGN_RIGHT;
	hadc3.Init.NbrOfConversion = 1;
	hadc3.Init.DMAContinuousRequests = DISABLE;
	hadc3.Init.EOCSelection = ADC_EOC_SINGLE_CONV;

	if(HAL_ADC_Init(&hadc3) != HAL_OK)
	{
		Error_Handler();
	}
	
	sConfig.Channel = ADC_CHANNEL_0;
	sConfig.Rank = ADC_REGULAR_RANK_1;
	sConfig.SamplingTime = ADC_SAMPLETIME_15CYCLES;
	sConfig.Offset = 0;
	HAL_ADC_ConfigChannel(&hadc3, &sConfig);

}


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if(GPIO_Pin == GPIO_PIN_3)
	{
		HAL_NVIC_DisableIRQ(EXTI3_IRQn);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
		
		if(TRIAC_ControlState == ZERO_CROSS_TRIGGER_PENDING)
		{	
			triac_timer = 0;
			triac_on_timer = triac_on_time;			
			TRIAC_ControlState = TRIAC_ON_IN_FIRST_HALF_PERIOD;
			__HAL_TIM_SET_COUNTER(&htim3, 0);
			HAL_NVIC_EnableIRQ(TIM3_IRQn);
			HAL_TIM_Base_Start_IT(&htim3);
		}
	}
	else if(GPIO_Pin == GPIO_PIN_13)
	{
		HAL_NVIC_DisableIRQ(EXTI15_10_IRQn);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_13);
		if(GUI_Initialized == 1) TouchUpdate();
		ts_update_timer = TOUCH_SCREEN_UPDATE_TIME;
	}
}


static void MX_GPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOI_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_RESET);

	/*Configure GPIO pin : FAN_SPEED_SENSOR_Pin */
	GPIO_InitStruct.Pin = GPIO_PIN_3;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

	/*Configure GPIO pin : PH6 */
	GPIO_InitStruct.Pin = GPIO_PIN_6;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

	/* EXTI interrupt init*/
	HAL_NVIC_SetPriority(EXTI3_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(EXTI3_IRQn);

}


void TouchUpdate(void)
{
	static GUI_PID_STATE TS_State = {0, 0, 0, 0};
	__IO TS_StateTypeDef  ts;
	uint16_t xDiff, yDiff;  

	BSP_TS_GetState((TS_StateTypeDef *)&ts);

	if((ts.touchX[0] >= LCD_GetXSize()) ||(ts.touchY[0] >= LCD_GetYSize()) ) 
	{
		ts.touchX[0] = 0;
		ts.touchY[0] = 0;
		ts.touchDetected =0;
	}

	xDiff = (TS_State.x > ts.touchX[0]) ? (TS_State.x - ts.touchX[0]) : (ts.touchX[0] - TS_State.x);
	yDiff = (TS_State.y > ts.touchY[0]) ? (TS_State.y - ts.touchY[0]) : (ts.touchY[0] - TS_State.y);


	if((TS_State.Pressed != ts.touchDetected ) || (xDiff > 30 ) || (yDiff > 30))
	{
		TS_State.Pressed = ts.touchDetected;
		TS_State.Layer = SelLayer;
		
		if(ts.touchDetected) 
		{
			TS_State.x = ts.touchX[0];
			TS_State.y = ts.touchY[0];
			GUI_TOUCH_StoreStateEx(&TS_State);
		}
		else
		{
			GUI_TOUCH_StoreStateEx(&TS_State);
			TS_State.x = 0;
			TS_State.y = 0;
		}
	}
}

void BootloaderExe(void)
{
//    HAL_ADC_MspDeInit(&hadc1);
	HAL_CRC_MspDeInit(&hcrc);
//    HAL_I2C_MspDeInit(&hi2c1);
    HAL_RTC_MspDeInit(&hrtc);
//    HAL_SPI_MspDeInit(&hspi2);
//    HAL_TIM_PWM_MspDeInit(&htim1);
//	HAL_TIM_PWM_MspDeInit(&htim2);
	HAL_TIM_PWM_MspDeInit(&htim3);
//    HAL_UART_MspDeInit(&huart1);
//    HAL_UART_MspDeInit(&huart2);	
    HAL_NVIC_DisableIRQ(USART1_IRQn);
	HAL_NVIC_DisableIRQ(PVD_IRQn);
    HAL_DeInit();
    HAL_FLASH_OB_Launch();
}


void Error_Handler(void)
{
   // BootloaderExe();
}


void FAN_SetSpeed(uint8_t fan_speed)
{
	if(fan_speed == FAN_OFF)
	{
		HAL_NVIC_DisableIRQ(EXTI3_IRQn);
		HAL_NVIC_DisableIRQ(TIM3_IRQn);
		__HAL_TIM_CLEAR_FLAG(&htim3, TIM_FLAG_UPDATE);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
		HAL_TIM_Base_Stop_IT(&htim3);
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_RESET);
		TRIAC_ControlState = ZERO_CROSS_TRIGGER_PENDING;
		triac_on_timer = 0;
		triac_on_time = 0;
		triac_timer = 0;
	}
	else 
	{
		HAL_TIM_Base_Stop_IT(&htim3);
		HAL_NVIC_DisableIRQ(TIM3_IRQn);
		HAL_NVIC_DisableIRQ(EXTI3_IRQn);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
		__HAL_TIM_CLEAR_FLAG(&htim3, TIM_FLAG_UPDATE);
		HAL_GPIO_WritePin(GPIOH, GPIO_PIN_6, GPIO_PIN_RESET);
		TRIAC_ControlState = ZERO_CROSS_TRIGGER_PENDING;
		triac_on_time = fan_speed;
		triac_on_timer = 0;		
		triac_timer = 0;
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);
		HAL_NVIC_EnableIRQ(EXTI3_IRQn);
	}
}


float NTC_GetResistance(uint16_t adc_value)
{
	float ntc_res;
	ntc_res = NTC_PULLUP *  (float) adc_value / ( 4095.0  - (float) adc_value);
	return(ntc_res);
}


float NTC_GetTemperature(float ntc_resistance)
{
	float temperature;
	temperature = (1.0 / ((log (ntc_resistance / NTC_RREF)) / NTC_B_VALUE  + 1.0 / 298.0)) - 273.0; 
	return(temperature);
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
